extends Node2D

onready var allies_group='ALLIES'
onready var enemies_group='ENEMIES'

var count=5

var party=[]
var full_party=false

var actors=[['Ибрагим', 'воин','ibr'],['Айяр', 'воин','aya'],['Хишаси', 'воин','his'],['Кирса', 'медик','kir'],
['Юки', 'медик','uki'],['Ортвин', 'медик','ort'],['Ансгар', 'алхимик','ans'],['Рио', 'алхимик','rio'],['Роланд', 'алхимик','rol']]
#var actors=[['Ибрагим', 'защитник','ibr'],['Айяр', 'воин','aya'],['Хишаси', 'ронин','his'],['Кирса', 'охотник','kir'],
#['Юки', 'Вор','uki'],['Ортвин', 'медик','ort'],['Ансгар', 'алхимик','ans'],['Рио', 'собака','rio']]

var characters={"ibr": [6, [3,4]],"aya": [6, [3,4]],"his": [6, [3,4]],"kir": [3, [11,12]],"uki": [3, [11,12]],
"ort": [3, [11,12]],"ans": [4, [13,14]],"rio": [4, [13,14]],"rol": [4, [13,14]]}
#var characters={"ibr": [10, [1,2]],"aya": [6, [3,4]],"his": [10, [5,6]],"kir": [10, [7,8]],"uki": [10, [9,10]],
#"ort": [3, [11,12]],"ans": [4, [13,14]],"rio": [10, [15,16]]}

var enemies={"gar": [12, [17,18]]}

#0 название
#1 область (1-на врага, 2-на союзника)
#2 эффект(1-повреждение,2-броня,3-лечение,4-наложение статуса, 5-удаление статусов,6-урон и наложение статуса)
#3 сила (кол-во урона, брони, 3-номер статуса)
#4 описание
#5 анимация
var skills=[0,['',0],['',0],['Удар',1,1,2,'Урон 2','1'],['Броня',2,2,2,'Броня следующему +2','5'],['',0],['',0],
['',0],['',0],['',0],['',0],['Ослабление',1,6,[1,1],'Урон 1\nДобавляет ослабление: -1 урон от следующей атаки','1'],
['Очищение',2,5,[2,3],'Снимает статус со следующего','7'],
['Поджёг',1,6,[1,2],'Урон 1\nДобавляет горение: наносит 1 урон в ход. Действует 2 хода','2'],
['Поджёг оружия',2,4,4,'Делает удар следующего поджигающим',0],['',0],['',0],
['Удар',1,1,3,'Урон 3','1'],
['Кровотечение',1,6,[2,3],'Урон 1\nДобавляет кровотечение: наносит 1 урон в ход. Действует 2 хода.','1']]

#0 название
#1 эффект (0-метка, 1-уменьшение атаки, 2-минус хп, 3-атака статусом)
#2 сила эффекта
#3 длительность
#4 анимация (0-нет)
#5 тип (0 - отрицательный, 1 - положительный, 2 - +броня)
var status=[['Метка',0,0,0,0,0],['Ослабление',1,1,1,'4',0],['Горение',2,1,2,'3',0],['Кровотечение',2,1,2,'6',0],['Поджигающее оружие',3,2,0,0,1]]

func playSE(f,d):
	$se.stream=load(f)
	$se.volume_db=d
	$se.play()

func bef_hit():
	var arr:Array
	var s=status
	for i in range(len(status)):
		if s[i][1]!=0:
			arr.push_back(i)
	return arr
